"""
Напишите функцию same_by(characteristic, objects), которая
проверяет, все ли объекты имеют одинаковое значение
некоторой характеристики, и возвращают True, если это так.
Если значение характеристики для разных объектов
отличается - то False. Для пустого набора объектов, функция
должна возвращать True. Аргумент characteristic - это
функция, которая принимает объект и вычисляет его
характеристику
"""
def same_by(characteristic, values):
    return len(set(map(characteristic, values))) < 2

a = list('12345678')

print(same_by(lambda x: x.isdigit(), a))